Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CM5112GC00100_DFP/component/mclk.h
#define MCLK_CLKMSK_MASK20(value)             (MCLK_CLKMSK_MASK20_Msk & (_UINT32_(value) << MCLK_CLKMSK_MASK20_Pos)) /* Assignment of value for MASK20 in the MCLK_CLKMSK register */
#define   MCLK_CLKMSK_MASK20_0_Val            _UINT32_(0x0)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped  */
#define   MCLK_CLKMSK_MASK20_1_Val            _UINT32_(0x1)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled  */
#define MCLK_CLKMSK_MASK20_0                  (MCLK_CLKMSK_MASK20_0_Val << MCLK_CLKMSK_MASK20_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped Position */
#define MCLK_CLKMSK_MASK20_1                  (MCLK_CLKMSK_MASK20_1_Val << MCLK_CLKMSK_MASK20_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled Position */
#define MCLK_CLKMSK_MASK21_Pos                _UINT32_(21)                                         /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Position */
#define MCLK_CLKMSK_MASK21_Msk                (_UINT32_(0x1) << MCLK_CLKMSK_MASK21_Pos)            /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Mask */
#define MCLK_CLKMSK_MASK21(value)             (MCLK_CLKMSK_MASK21_Msk & (_UINT32_(value) << MCLK_CLKMSK_MASK21_Pos)) /* Assignment of value for MASK21 in the MCLK_CLKMSK register */
#define   MCLK_CLKMSK_MASK21_0_Val            _UINT32_(0x0)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped  */
#define   MCLK_CLKMSK_MASK21_1_Val            _UINT32_(0x1)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled  */
#define MCLK_CLKMSK_MASK21_0                  (MCLK_CLKMSK_MASK21_0_Val << MCLK_CLKMSK_MASK21_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped Position */
#define MCLK_CLKMSK_MASK21_1                  (MCLK_CLKMSK_MASK21_1_Val << MCLK_CLKMSK_MASK21_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled Position */
#define MCLK_CLKMSK_MASK22_Pos                _UINT32_(22)                                         /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Position */
#define MCLK_CLKMSK_MASK22_Msk                (_UINT32_(0x1) << MCLK_CLKMSK_MASK22_Pos)            /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Mask */
#define MCLK_CLKMSK_MASK22(value)             (MCLK_CLKMSK_MASK22_Msk & (_UINT32_(value) << MCLK_CLKMSK_MASK22_Pos)) /* Assignment of value for MASK22 in the MCLK_CLKMSK register */
#define   MCLK_CLKMSK_MASK22_0_Val            _UINT32_(0x0)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped  */
#define   MCLK_CLKMSK_MASK22_1_Val            _UINT32_(0x1)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled  */
#define MCLK_CLKMSK_MASK22_0                  (MCLK_CLKMSK_MASK22_0_Val << MCLK_CLKMSK_MASK22_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped Position */
#define MCLK_CLKMSK_MASK22_1                  (MCLK_CLKMSK_MASK22_1_Val << MCLK_CLKMSK_MASK22_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled Position */
#define MCLK_CLKMSK_MASK23_Pos                _UINT32_(23)                                         /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Position */
#define MCLK_CLKMSK_MASK23_Msk                (_UINT32_(0x1) << MCLK_CLKMSK_MASK23_Pos)            /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Mask */
#define MCLK_CLKMSK_MASK23(value)             (MCLK_CLKMSK_MASK23_Msk & (_UINT32_(value) << MCLK_CLKMSK_MASK23_Pos)) /* Assignment of value for MASK23 in the MCLK_CLKMSK register */
#define   MCLK_CLKMSK_MASK23_0_Val            _UINT32_(0x0)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped  */
#define   MCLK_CLKMSK_MASK23_1_Val            _UINT32_(0x1)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled  */
#define MCLK_CLKMSK_MASK23_0                  (MCLK_CLKMSK_MASK23_0_Val << MCLK_CLKMSK_MASK23_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped Position */
#define MCLK_CLKMSK_MASK23_1                  (MCLK_CLKMSK_MASK23_1_Val << MCLK_CLKMSK_MASK23_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled Position */
#define MCLK_CLKMSK_MASK24_Pos                _UINT32_(24)                                         /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Position */
#define MCLK_CLKMSK_MASK24_Msk                (_UINT32_(0x1) << MCLK_CLKMSK_MASK24_Pos)            /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Mask */
#define MCLK_CLKMSK_MASK24(value)             (MCLK_CLKMSK_MASK24_Msk & (_UINT32_(value) << MCLK_CLKMSK_MASK24_Pos)) /* Assignment of value for MASK24 in the MCLK_CLKMSK register */
#define   MCLK_CLKMSK_MASK24_0_Val            _UINT32_(0x0)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped  */
#define   MCLK_CLKMSK_MASK24_1_Val            _UINT32_(0x1)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled  */
#define MCLK_CLKMSK_MASK24_0                  (MCLK_CLKMSK_MASK24_0_Val << MCLK_CLKMSK_MASK24_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped Position */
#define MCLK_CLKMSK_MASK24_1                  (MCLK_CLKMSK_MASK24_1_Val << MCLK_CLKMSK_MASK24_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled Position */
#define MCLK_CLKMSK_MASK25_Pos                _UINT32_(25)                                         /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Position */
#define MCLK_CLKMSK_MASK25_Msk                (_UINT32_(0x1) << MCLK_CLKMSK_MASK25_Pos)            /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Mask */
#define MCLK_CLKMSK_MASK25(value)             (MCLK_CLKMSK_MASK25_Msk & (_UINT32_(value) << MCLK_CLKMSK_MASK25_Pos)) /* Assignment of value for MASK25 in the MCLK_CLKMSK register */
#define   MCLK_CLKMSK_MASK25_0_Val            _UINT32_(0x0)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped  */
#define   MCLK_CLKMSK_MASK25_1_Val            _UINT32_(0x1)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled  */
#define MCLK_CLKMSK_MASK25_0                  (MCLK_CLKMSK_MASK25_0_Val << MCLK_CLKMSK_MASK25_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped Position */
#define MCLK_CLKMSK_MASK25_1                  (MCLK_CLKMSK_MASK25_1_Val << MCLK_CLKMSK_MASK25_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled Position */
#define MCLK_CLKMSK_MASK26_Pos                _UINT32_(26)                                         /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Position */
#define MCLK_CLKMSK_MASK26_Msk                (_UINT32_(0x1) << MCLK_CLKMSK_MASK26_Pos)            /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Mask */
#define MCLK_CLKMSK_MASK26(value)             (MCLK_CLKMSK_MASK26_Msk & (_UINT32_(value) << MCLK_CLKMSK_MASK26_Pos)) /* Assignment of value for MASK26 in the MCLK_CLKMSK register */
#define   MCLK_CLKMSK_MASK26_0_Val            _UINT32_(0x0)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped  */
#define   MCLK_CLKMSK_MASK26_1_Val            _UINT32_(0x1)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled  */
#define MCLK_CLKMSK_MASK26_0                  (MCLK_CLKMSK_MASK26_0_Val << MCLK_CLKMSK_MASK26_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped Position */
#define MCLK_CLKMSK_MASK26_1                  (MCLK_CLKMSK_MASK26_1_Val << MCLK_CLKMSK_MASK26_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled Position */
#define MCLK_CLKMSK_MASK27_Pos                _UINT32_(27)                                         /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Position */
#define MCLK_CLKMSK_MASK27_Msk                (_UINT32_(0x1) << MCLK_CLKMSK_MASK27_Pos)            /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Mask */
#define MCLK_CLKMSK_MASK27(value)             (MCLK_CLKMSK_MASK27_Msk & (_UINT32_(value) << MCLK_CLKMSK_MASK27_Pos)) /* Assignment of value for MASK27 in the MCLK_CLKMSK register */
#define   MCLK_CLKMSK_MASK27_0_Val            _UINT32_(0x0)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped  */
#define   MCLK_CLKMSK_MASK27_1_Val            _UINT32_(0x1)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled  */
#define MCLK_CLKMSK_MASK27_0                  (MCLK_CLKMSK_MASK27_0_Val << MCLK_CLKMSK_MASK27_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped Position */
#define MCLK_CLKMSK_MASK27_1                  (MCLK_CLKMSK_MASK27_1_Val << MCLK_CLKMSK_MASK27_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled Position */
#define MCLK_CLKMSK_MASK28_Pos                _UINT32_(28)                                         /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Position */
#define MCLK_CLKMSK_MASK28_Msk                (_UINT32_(0x1) << MCLK_CLKMSK_MASK28_Pos)            /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Mask */
#define MCLK_CLKMSK_MASK28(value)             (MCLK_CLKMSK_MASK28_Msk & (_UINT32_(value) << MCLK_CLKMSK_MASK28_Pos)) /* Assignment of value for MASK28 in the MCLK_CLKMSK register */
#define   MCLK_CLKMSK_MASK28_0_Val            _UINT32_(0x0)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped  */
#define   MCLK_CLKMSK_MASK28_1_Val            _UINT32_(0x1)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled  */
#define MCLK_CLKMSK_MASK28_0                  (MCLK_CLKMSK_MASK28_0_Val << MCLK_CLKMSK_MASK28_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped Position */
#define MCLK_CLKMSK_MASK28_1                  (MCLK_CLKMSK_MASK28_1_Val << MCLK_CLKMSK_MASK28_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled Position */
#define MCLK_CLKMSK_MASK29_Pos                _UINT32_(29)                                         /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Position */
#define MCLK_CLKMSK_MASK29_Msk                (_UINT32_(0x1) << MCLK_CLKMSK_MASK29_Pos)            /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Mask */
#define MCLK_CLKMSK_MASK29(value)             (MCLK_CLKMSK_MASK29_Msk & (_UINT32_(value) << MCLK_CLKMSK_MASK29_Pos)) /* Assignment of value for MASK29 in the MCLK_CLKMSK register */
#define   MCLK_CLKMSK_MASK29_0_Val            _UINT32_(0x0)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped  */
#define   MCLK_CLKMSK_MASK29_1_Val            _UINT32_(0x1)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled  */
#define MCLK_CLKMSK_MASK29_0                  (MCLK_CLKMSK_MASK29_0_Val << MCLK_CLKMSK_MASK29_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped Position */
#define MCLK_CLKMSK_MASK29_1                  (MCLK_CLKMSK_MASK29_1_Val << MCLK_CLKMSK_MASK29_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled Position */
#define MCLK_CLKMSK_MASK30_Pos                _UINT32_(30)                                         /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Position */
#define MCLK_CLKMSK_MASK30_Msk                (_UINT32_(0x1) << MCLK_CLKMSK_MASK30_Pos)            /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Mask */
#define MCLK_CLKMSK_MASK30(value)             (MCLK_CLKMSK_MASK30_Msk & (_UINT32_(value) << MCLK_CLKMSK_MASK30_Pos)) /* Assignment of value for MASK30 in the MCLK_CLKMSK register */
#define   MCLK_CLKMSK_MASK30_0_Val            _UINT32_(0x0)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped  */
#define   MCLK_CLKMSK_MASK30_1_Val            _UINT32_(0x1)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled  */
#define MCLK_CLKMSK_MASK30_0                  (MCLK_CLKMSK_MASK30_0_Val << MCLK_CLKMSK_MASK30_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped Position */
#define MCLK_CLKMSK_MASK30_1                  (MCLK_CLKMSK_MASK30_1_Val << MCLK_CLKMSK_MASK30_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled Position */
#define MCLK_CLKMSK_MASK31_Pos                _UINT32_(31)                                         /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Position */
#define MCLK_CLKMSK_MASK31_Msk                (_UINT32_(0x1) << MCLK_CLKMSK_MASK31_Pos)            /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Mask */
#define MCLK_CLKMSK_MASK31(value)             (MCLK_CLKMSK_MASK31_Msk & (_UINT32_(value) << MCLK_CLKMSK_MASK31_Pos)) /* Assignment of value for MASK31 in the MCLK_CLKMSK register */
#define   MCLK_CLKMSK_MASK31_0_Val            _UINT32_(0x0)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped  */
#define   MCLK_CLKMSK_MASK31_1_Val            _UINT32_(0x1)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled  */
#define MCLK_CLKMSK_MASK31_0                  (MCLK_CLKMSK_MASK31_0_Val << MCLK_CLKMSK_MASK31_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped Position */
#define MCLK_CLKMSK_MASK31_1                  (MCLK_CLKMSK_MASK31_1_Val << MCLK_CLKMSK_MASK31_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled Position */
#define MCLK_CLKMSK_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (MCLK_CLKMSK) Register Mask  */

#define MCLK_CLKMSK_MASK_Pos                  _UINT32_(0)                                          /* (MCLK_CLKMSK Position) Peripheral Clock Enable Mask */
#define MCLK_CLKMSK_MASK_Msk                  (_UINT32_(0xFFFFFFFF) << MCLK_CLKMSK_MASK_Pos)       /* (MCLK_CLKMSK Mask) MASK */
#define MCLK_CLKMSK_MASK(value)               (MCLK_CLKMSK_MASK_Msk & (_UINT32_(value) << MCLK_CLKMSK_MASK_Pos)) 

